openfoam/spot_melting_marangoni/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    top
    {
        type            patch;
        nFaces          10000;
        startFace       1480000;
    }
    bottom
    {
        type            patch;
        nFaces          10000;
        startFace       1490000;
    }
    xMin
    {
        type            patch;
        nFaces          5000;
        startFace       1500000;
    }
    xMax
    {
        type            patch;
        nFaces          5000;
        startFace       1505000;
    }
    zMin
    {
        type            patch;
        nFaces          5000;
        startFace       1510000;
    }
    zMax
    {
        type            patch;
        nFaces          5000;
        startFace       1515000;
    }
)

// ************************************************************************* //
