openfoam/spot_melting_marangoni/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    top
    {
        type            zeroGradient;
    }
    bottom
    {
        type            fixedValue;
        value           uniform 300;
    }
    xMin
    {
        type            fixedValue;
        value           uniform 300;
    }
    xMax
    {
        type            fixedValue;
        value           uniform 300;
    }
    zMin
    {
        type            fixedValue;
        value           uniform 300;
    }
    zMax
    {
        type            fixedValue;
        value           uniform 300;
    }
}

// ************************************************************************* //
